In [11]:
import os

import mysql.connector
# from mysql import connector
from dotenv import load_dotenv
import pandas as pd

In [2]:
load_dotenv()

# print(os.getenv('USER'))
user = os.getenv('USER')
password = os.getenv('PASSWORD')
host = os.getenv('HOST')
database = 'swiftmarket'

In [5]:
connection = mysql.connector.connect(user=user,
                                     password=password,
                                     host=host,
                                     database=database )
cursor = connection.cursor()

In [6]:
connection.is_connected()

True

In [7]:
query = '''show tables'''
cursor.execute(query)
rows = cursor.fetchall()
for row in rows:
    print(row)

('categories',)
('customers',)
('employees',)
('salesdata',)
('subcategories',)
('suppliers',)

In [8]:
# dimension tables: all tables contianing primary keys and connected to fact table
# fact table: e.g sales data


query = '''select * from salesdata limit 5;'''
cursor.execute(query)
rows = cursor.fetchall()
for row in rows:
    print(row)

(23000, 'C-2023-100-12', 6002, 1100, datetime.date(2023, 5, 2), 2, Decimal('176432.00'))
(23001, 'C-2023-100-141', 6029, 1115, datetime.date(2023, 12, 26), 2, Decimal('47172.00'))
(23002, 'C-2023-100-86', 6029, 1035, datetime.date(2023, 3, 26), 2, Decimal('47172.00'))
(23003, 'C-2023-100-72', 6006, 1016, datetime.date(2023, 8, 1), 2, Decimal('117644.00'))
(23004, 'C-2023-100-142', 6030, 1067, datetime.date(2023, 3, 6), 5, Decimal('336560.00'))

In [9]:
cursor.column_names

('SaleID',
 'CustomerID',
 'SubcatID',
 'EmployeeID',
 'SaleDate',
 'Quantity',
 'TotalPrice')

In [13]:
pd.DataFrame(data=rows, columns=cursor.column_names)

,SaleID,CustomerID,SubcatID,EmployeeID,SaleDate,Quantity,TotalPrice
0,23000,C-2023-100-12,6002,1100,2023-05-02,2,176432.00
1,23001,C-2023-100-141,6029,1115,2023-12-26,2,47172.00
2,23002,C-2023-100-86,6029,1035,2023-03-26,2,47172.00
3,23003,C-2023-100-72,6006,1016,2023-08-01,2,117644.00
4,23004,C-2023-100-142,6030,1067,2023-03-06,5,336560.00

In [14]:
def read_query(query):
    cursor.execute(query)
    rows = cursor.fetchall()
    return pd.DataFrame(data=rows, columns=cursor.column_names)

In [17]:
query = '''select * from customers limit 5;'''
read_query(query)

,CustomerID,FirstName,LastName,Email,Phone,Address,State
0,C-2023-100-1,Mahika,Sunder,MahikaSunder_11@zmail.com,03412176590,"H.No. 155, Chana",Assam
1,C-2023-100-10,Zeeshan,Vasa,ZeeshanVasa_1@zmail.com,+911151051656,"52, Roy Nagar",Tripura
2,C-2023-100-100,Aaina,Sachdeva,AainaSachdeva_9@zmail.com,+918834507719,"75/92, Kade Marg",Nagaland
3,C-2023-100-101,Shray,Bajwa,ShrayBajwa_11@zmail.com,07410498662,"45, Bora Ganj",Manipur
4,C-2023-100-102,Navya,Dash,NavyaDash_5@zmail.com,+917644200850,70/782\nBahl Road,Kerala

In [19]:
query = '''select s.saledate,c.firstname,s.totalprice
from salesdata s
join customers c
on s.customerid=c.customerid
order by s.saledate;'''
read_query(query)

         saledate firstname totalprice
0      2023-01-01    Miraan    8630.00
1      2023-01-01       Eva  159724.00
2      2023-01-01    Kashvi  139084.00
3      2023-01-01     Shalv  208626.00
4      2023-01-01      Heer   79387.00
...           ...       ...        ...
11996  2023-12-30      Azad  111075.00
11997  2023-12-30     Vidur   58785.00
11998  2023-12-30   Reyansh    9599.00
11999  2023-12-30     Sahil   99402.00
12000  2023-12-30   Inaaya   340156.00

[12001 rows x 3 columns]